from dataclasses import dataclass


@dataclass
class DataProfanity:
    base_pattern = (r'\b([хx][уyю][йjеёи]|[пp][иеi][з3z][дd]|[б6][лl][яaа@]|['
                    r'её][б6][аaа@]'
                    r'|[сc][уy][кk][аaа@]|[мm][уy][дd][аaкk]|[гg][аa][вv][нn][оo0]'
                    r'|[пp][иi][дd][аaоo][рr][аaоo]|[з3z][аa][еe][б6][аa]|[оo0][тt][ъь]?[еeё][б6]'
                    r'|[дd][еe][б6][иi][лl]|[дd][уy][рr][аa][кk]|[ч4][мm][оo0]|[шs][лl][юu][хxh]'
                    r'|[пp][оo0][сc][рr][аa][тtь]|[мm][аa][нn][дd][аa]|[еeё][б6][аa][лl]'
                    r'|[вv][ыy][еeё][б6][аa])\w*\b')

    additional_patterns = [
        r'\b[аa][хxh][уy][еeё][лlтt]\w*\b',
        r'\b[пp][иi][з3z][дd][аaоo][кkцc]\w*\b',
        r'\b[хxh][уy][йj][лl][оo0]\b',
        r'\b[сc][уy][ч4][кk][аaиi]\w*\b',
        r'\b[мm][аa][тt][ь]\b',
        r'\b[оo0][тt][пp][иi][з3z][дd]\w*\b',
        r'\b[з3z][аa][пp][иi][з3z][дd]\w*\b',
        r'\b[нn][еe][вv][рr][оo0][тt][еe][б6]\w*\b',
        r'\b[гg][аa][нn][дd][оo0][нn]\w*\b',
        r'\b[гg][аaа@á][нn][дd][оo0][нn]\w*\b',
        r'\b[мm][уy][дd][аa][кk]\w*\b',
        r'\b[дd][еe][рr][ь][мm][оo0]\w*\b',
        r'\b[з3z][аa][лl][уy][пp]\w*\b',
        r'\b[пp][иi][дd][оo0][рr]\w*\b',
        r'\b[ч4][мm][оo0][ш6][иi]\w*\b',
        r'\b[ш6][лl][юy][хxh]\w*\b',
        r'\b[б6][лl][яy][дd]\w*\b',
        r'\b[еeё][б6][аa][нn]\w*\b',
        r'\b[пp][оo0][хxh][уy][йj]\w*\b'
        r'\b[вv][ыy][еeё][б6]\w*\b',
        r'\b[бb6][лl][яaя][дd][ь]\w*\b',
        r'\b[еeё][бb6][аa@á][нnтt]\w*\b',
        r'\b[пp][иi][дd][оo0][рr][аa]\w*\b',
        r'\b[уy][еeё][бb6][аa@á]\w*\b',
        r'\b[дd][аa][лl][бb6][аa][оo0][бb6]\w*\b',
        r'\b[з3z][аa][лl][уy][пp][аa]\w*\b',
        r'\b[мm][уy][дd][аa][кkцc]\w*\b',
        r'\b[ч4][мm][оo0][рr][дd]\w*\b',
        r'\b[шsh8][лl][юu][хxh][аa]\w*\b',
        r'\b[пp][оo0][хxh][уy][йj]\w*\b',
        r'\b[жj][оo0][пp][аa]\w*\b',
        r'\b[гg][оo0][вv][нn][оo0]\w*\b',
        r'\b[дd][еe][рr][ь][мm][оo0]\w*\b',
        r'\b[вv][ыy][сc][еeё][рr]\w*\b',
        r'\b[пp][иi][дd][аa][рr]\w*\b',
        r'\b[сc][кk][оo0][тt][иi][лl]\w*\b',
        r'\b[уy][рr][оo0][дd]\w*\b',
        r'\b[тt][рr][аa][хxh]\w*\b',
        r'\b[вv][ыy][еeё][бb6]\w*\b',
        r'\b[пp][оo0][еeё][бb6]\w*\b',
        r'\b[нn][еe][гg][рr]\w*\b',
        r'\b[ч4][уy][рr][кk][аa]\w*\b',
        r'\b[пp][иi][сs][дd][еeё][цc]\w*\b',
        r'\b[оo0][хxh][уy][еe][тt]\w*\b',
        r'\b[пp][оo0][мm][оo0][йj][кk]\w*\b',
        r'\b[пp][i1l][з3z][dд][аaоo0]\w*\b',
        r'\b[сc][уy][кk4][аaиi]\w*\b',
        r'\b[еeё][b6][лl][яaя][нnтtь]\w*\b',
        r'\b[xх][yу][йjи]\w*\b',
        r'\b[дd][рr][яa][нn][ь]\w*\b',
        r'\b[пp][иеi1][з3z][дd][аaоoеeиiцc]\w*\b',
        r'\b[пp][иеi1][з3z][дd][аaоoеeиi]?\w*\b',
        r'\bfuck\w*\b',
        r'\bshit\w*\b',
        r'\basshole\w*\b',
        r'\bbitch\w*\b',
        r'\bdick\w*\b',
        r'\bcunt\w*\b',
        r'\bwhore\w*\b',
        r'\bretard\w*\b',
        r'\bidiot\w*\b',
        r'\bmoron\w*\b', r'х[а@][у]й',  # х@й, хау, хау, ху@й
        r'п[и!][з][д][а]',  # п!зда, пизда, пизд@, пизда!
        r'б[л$][я%][д]ь',  # бл9дь, блядь, блядь, блядь
        r'ш[л][ю][х][а]',  # шльуха, шлюха, шлюха
        r'х\.у\.й',  # х.у.й
        r'п!з!д!а',  # п!з!д!а
        r'е[#][б][@][а][@][л]',  # е#б@а@л
        r'б[$][л][%][я][^][д]ь',  # б$л%я^дь
        r'с\*[у]\*[к]\*[а]',  # с*у*к*а
        r'бл9dь',  # бл9dь
        r'\b[сc][\W_]*[уu][\W_]*[кk][\W_]*[аa@]\b|\b[сc][\W_]*[уu][\W_]*[кk]['
        r'\W_]*[оo0][\W_]*[вb][\W_]*[аa@]\b',
        r'\b[хhx][\W_]*[уu][\W_]*[ийiуy]\b',
        r'\b[б6b][\W_]*(л|l|ь)[\W_]*(я|\@|a|а)[\W_]*(д|d|в)[\W_]*(ь|\'|ъ|b)?\b',
        r'\b[хx][*]+[йy]\b|\b[хx][*]*[уu][*]*[йy]\b',
        r'\b[пp][*]+[аa]\b|\b[пp][*]*[иi][*]*[з3][*]*[дd][*]*[аa]\b',
        r'\b[б6b][*]+[ь\']\b|\b[б6b][*]*[лl][*]*[яa][*]*[дd][*]*[ь\']\b',
        r'\b[шw][*_\-]+[аa@]\b|\b[шw][*_\-]*[лl][*_\-]*[юu][*_\-]*[хxh]['
        r'*_\-]*[аa@]\b',
        r'\b[мm][*_\-]+[ь\']\b|\b[мm][*_\-]*[рr][*_\-]*[аa][*_\-]*[з3][*_\-]*['
        r'ь\']\b',
        r'\b[з3][*_\-]+[аa]\b|\b[з3][*_\-]*[аa][*_\-]*[лl][*_\-]*[уu][*_\-]*['
        r'пp][*_\-]*[аa]\b',
        r'\b[пp][*_\-]+[рr]\b|\b[пp][*_\-]*[иi][*_\-]*[дd][*_\-]*[оo][*_\-]*[рr]\b'
        ]
    
    CHAR_REPLACEMENT_MAP = {
        'а': ('а', 'a', '@'),
        'б': ('б', '6', 'b'),
        'в': ('в', 'b', 'v'),
        'г': ('г', 'r', 'g'),
        'д': ('д', 'd'),
        'е': ('е', 'e'),
        'ё': ('ё', 'e'),
        'ж': ('ж', 'zh', '*'),
        'з': ('з', '3', 'z'),
        'и': ('и', 'u', 'i'),
        'й': ('й', 'u', 'i'),
        'к': ('к', 'k', 'i{', '|{'),
        'л': ('л', 'l', 'ji'),
        'м': ('м', 'm'),
        'н': ('н', 'h', 'n'),
        'о': ('о', 'o', '0'),
        'п': ('п', 'n', 'p'),
        'р': ('р', 'r', 'p'),
        'с': ('с', 'c', 's'),
        'т': ('т', 'm', 't'),
        'у': ('у', 'y', 'u'),
        'ф': ('ф', 'f'),
        'х': ('х', 'x', 'h', '}{'),
        'ц': ('ц', 'c', 'u,'),
        'ч': ('ч', 'ch'),
        'ш': ('ш', 'sh'),
        'щ': ('щ', 'sch'),
        'ь': ('ь', 'b'),
        'ы': ('ы', 'bi'),
        'ъ': ('ъ',),
        'э': ('э', 'e'),
        'ю': ('ю', 'io'),
        'я': ('я', 'ya')}
